In [1]:
import plotly.express as px
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

C:\Users\Administrator\anaconda3\lib\site-packages\scipy\__init__.py:146: UserWarning: A NumPy version >=1.16.5 and <1.23.0 is required for this version of SciPy (detected version 1.23.2
  warnings.warn(f"A NumPy version >={np_minversion} and <{np_maxversion}"

# Open Data CSV #####

In [2]:
test_titanic = pd.read_csv('test.csv')
gender_sub = pd.read_csv('gender_submission.csv')
train_titanic = pd.read_csv('train.csv')

In [3]:
train_titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [4]:
test_titanic

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [5]:
test_titanic.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [6]:
train_titanic.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [7]:
train_titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [8]:
test_titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          332 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Cabin        91 non-null     object
 10  Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

# Del Columns and Remove NAN lines from Training Data

In [9]:
train_titanic = train_titanic.drop(['Name','Ticket','Cabin'], axis=1)
train_titanic

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked
0,1,0,3,male,22.0,1,0,7.2500,S
1,2,1,1,female,38.0,1,0,71.2833,C
2,3,1,3,female,26.0,0,0,7.9250,S
3,4,1,1,female,35.0,1,0,53.1000,S
4,5,0,3,male,35.0,0,0,8.0500,S
...,...,...,...,...,...,...,...,...,...
886,887,0,2,male,27.0,0,0,13.0000,S
887,888,1,1,female,19.0,0,0,30.0000,S
888,889,0,3,female,NaN,1,2,23.4500,S
889,890,1,1,male,26.0,0,0,30.0000,C
890,891,0,3,male,32.0,0,0,7.7500,Q

In [10]:
train_titanic.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Sex              0
Age            177
SibSp            0
Parch            0
Fare             0
Embarked         2
dtype: int64

# Calculate the age´s mean to replace with NaN Train Data

In [11]:
train_titanic['Age'].fillna(test_titanic['Age'].mean(), inplace=True)
train_titanic.dropna(inplace=True)

# Remove unnecessary columns and fill Nan with Age mean on Testing Data

In [12]:
test_titanic = test_titanic.drop(['Name','Ticket','Cabin'], axis=1)
test_titanic['Age'].fillna(test_titanic['Age'].mean(),inplace=True)
test_titanic['Fare'].fillna(test_titanic['Fare'].mean(),inplace=True)
test_titanic

     PassengerId  Pclass     Sex       Age  SibSp  Parch      Fare Embarked
0            892       3    male  34.50000      0      0    7.8292        Q
1            893       3  female  47.00000      1      0    7.0000        S
2            894       2    male  62.00000      0      0    9.6875        Q
3            895       3    male  27.00000      0      0    8.6625        S
4            896       3  female  22.00000      1      1   12.2875        S
..           ...     ...     ...       ...    ...    ...       ...      ...
413         1305       3    male  30.27259      0      0    8.0500        S
414         1306       1  female  39.00000      0      0  108.9000        C
415         1307       3    male  38.50000      0      0    7.2500        S
416         1308       3    male  30.27259      0      0    8.0500        S
417         1309       3    male  30.27259      1      1   22.3583        C

[418 rows x 8 columns]

In [13]:
test_titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Sex          418 non-null    object
 3   Age          418 non-null    float64
 4   SibSp        418 non-null    int64
 5   Parch        418 non-null    int64
 6   Fare         418 non-null    float64
 7   Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(2)
memory usage: 26.2+ KB

# Change de column type

In [14]:
train_titanic[['Age']]=train_titanic[['Age']].astype('int')
train_titanic.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Sex             object
Age              int32
SibSp            int64
Parch            int64
Fare           float64
Embarked        object
dtype: object

In [15]:
test_titanic[['Age']]=test_titanic[['Age']].astype('int')
test_titanic.dtypes

PassengerId      int64
Pclass           int64
Sex             object
Age              int32
SibSp            int64
Parch            int64
Fare           float64
Embarked        object
dtype: object

# converting categorical data into Numerical OrdinalEncoder (Training/Testing)

In [16]:
from sklearn.preprocessing import OrdinalEncoder

object_list = ['Sex','Embarked']
ordinalEncoder = OrdinalEncoder(handle_unknown='use_encoded_value', unknown_value=-99).fit(train_titanic[object_list])
train_titanic[object_list] = ordinalEncoder.transform(train_titanic[object_list])

In [17]:
object_list = ['Sex','Embarked']
ordinalEncoder = OrdinalEncoder(handle_unknown='use_encoded_value', unknown_value=-99).fit(test_titanic[object_list])
test_titanic[object_list] = ordinalEncoder.transform(test_titanic[object_list])

# check number os columns in each data and remove two extra columns from testing

In [18]:
train_titanic.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Sex', 'Age', 'SibSp', 'Parch',
       'Fare', 'Embarked'],
      dtype='object')

In [19]:
test_titanic.columns

Index(['PassengerId', 'Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare',
       'Embarked'],
      dtype='object')

# Machine Learning - Separate columns X,Y and training by using DecisionTreeClassifier

In [20]:
train_titanic.head()

   PassengerId  Survived  Pclass  Sex  Age  SibSp  Parch     Fare  Embarked
0            1         0       3  1.0   22      1      0   7.2500       2.0
1            2         1       1  0.0   38      1      0  71.2833       0.0
2            3         1       3  0.0   26      0      0   7.9250       2.0
3            4         1       1  0.0   35      1      0  53.1000       2.0
4            5         0       3  1.0   35      0      0   8.0500       2.0

In [21]:
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import StandardScaler

scaler = StandardScaler()

y = train_titanic["Survived"]
X = scaler.fit_transform(train_titanic.drop("Survived", axis=1))

x_train, x_test, y_train, y_test = train_test_split(X,y, test_size=0.3)

In [22]:
x_train.shape

(622, 8)

In [23]:
x_test.shape

(267, 8)

In [62]:
from sklearn.tree import DecisionTreeClassifier
from sklearn.ensemble import GradientBoostingClassifier,RandomForestClassifier
from xgboost import XGBClassifier
from sklearn.neighbors import KNeighborsClassifier
from sklearn import svm

modelo_decisao = GradientBoostingClassifier()
modelo_fitado = modelo_decisao.fit(x_train,y_train)

# Criating predict with testing data

In [63]:
previsao_classificacao = modelo_fitado.predict(x_test)

In [64]:
print(previsao_classificacao)

[0 1 0 0 0 0 1 0 0 0 0 1 0 0 1 0 1 0 1 0 0 1 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0
 1 0 1 0 1 0 0 0 0 1 1 0 1 0 0 0 0 0 0 1 1 0 0 1 0 0 0 0 0 0 0 1 1 0 1 1 0
 0 0 0 0 1 0 0 0 0 1 1 0 0 0 0 0 0 0 0 0 1 0 1 0 0 0 1 1 1 1 0 0 0 1 0 0 0
 0 0 0 0 0 0 0 1 0 1 1 1 0 1 0 0 1 0 0 1 1 0 0 0 0 0 0 0 1 0 0 0 0 0 0 0 0
 0 0 1 0 0 0 1 0 0 0 0 0 1 0 0 1 0 1 0 0 0 1 1 0 0 1 1 1 0 0 0 1 0 0 0 0 1
 0 0 0 0 1 1 0 1 0 0 0 1 0 0 1 0 0 0 0 0 1 0 1 0 0 1 0 0 0 0 0 0 0 0 0 0 0
 1 0 0 1 0 0 1 0 1 1 0 0 0 1 0 0 1 0 0 0 0 0 0 0 0 0 0 0 1 0 0 0 0 0 1 1 0
 0 0 1 0 1 0 0 0]

In [65]:
previsao_classificacao.shape

(267,)

# Metricas

In [66]:
from sklearn.metrics import roc_auc_score
from sklearn.metrics import confusion_matrix
from sklearn.metrics import classification_report

In [67]:
matriz_confusao = pd.DataFrame(data=confusion_matrix(y_test, previsao_classificacao),columns=['Y_test','DecisionTreeClassifier'])
print('matriz de confusão\n', matriz_confusao)

print("\n",classification_report(y_test,previsao_classificacao))

print('ROC SCORE: ', roc_auc_score(y_test, previsao_classificacao)*100)

print('Acurácia da biblioteca DecisionTreeClassifier do SKLearn : ', np.mean(np.equal(previsao_classificacao, y_test)))

matriz de confusão
    Y_test  DecisionTreeClassifier
0     157                       9
1      38                      63

               precision    recall  f1-score   support

           0       0.81      0.95      0.87       166
           1       0.88      0.62      0.73       101

    accuracy                           0.82       267
   macro avg       0.84      0.78      0.80       267
weighted avg       0.83      0.82      0.82       267

ROC SCORE:  78.47727543838722
Acurácia da biblioteca DecisionTreeClassifier do SKLearn :  0.8239700374531835

# Predict test_titanic

In [68]:
test_titanic_scaler = scaler.fit_transform(test_titanic)

In [69]:
test_titanic_scaler

array([[-1.72791209,  0.87348191,  0.75592895, ..., -0.4002477 ,
        -0.49840706, -0.47091535],
       [-1.71962474,  0.87348191, -1.32287566, ..., -0.4002477 ,
        -0.51327429,  0.70076689],
       [-1.71133739, -0.31581919,  0.75592895, ..., -0.4002477 ,
        -0.46508846, -0.47091535],
       ...,
       [ 1.71133739,  0.87348191,  0.75592895, ..., -0.4002477 ,
        -0.50879189,  0.70076689],
       [ 1.71962474,  0.87348191,  0.75592895, ..., -0.4002477 ,
        -0.4944482 ,  0.70076689],
       [ 1.72791209,  0.87348191,  0.75592895, ...,  0.61989583,
        -0.23790598, -1.64259759]])

In [70]:
predict_test_titanic = modelo_fitado.predict(test_titanic_scaler)

In [71]:
predict_test_titanic.shape

(418,)

In [72]:
print(predict_test_titanic)

[0 1 0 0 1 0 1 0 0 0 0 0 1 0 1 1 0 0 1 0 0 1 1 0 1 0 1 0 0 0 0 0 0 0 0 0 0
 0 0 0 0 0 0 1 1 0 0 0 1 0 0 0 1 1 0 0 0 0 0 1 0 0 0 1 0 1 1 0 0 1 1 0 1 0
 1 0 0 1 0 1 1 0 0 0 0 0 1 0 1 1 0 0 1 0 0 0 1 0 1 0 1 0 0 0 1 0 0 0 0 0 0
 1 1 0 1 0 0 1 0 1 1 0 1 0 0 0 0 1 0 0 0 0 1 0 0 0 0 0 0 0 0 1 0 0 0 0 0 0
 0 0 1 0 0 0 0 0 1 1 0 0 1 1 1 0 0 0 0 0 1 0 0 0 0 0 0 1 1 0 1 1 0 0 1 0 1
 0 1 0 0 0 0 0 0 0 1 0 1 1 0 0 0 1 0 1 0 0 1 0 1 0 0 0 0 1 1 0 1 0 1 0 1 0
 1 0 1 0 0 1 0 0 1 1 0 0 1 0 0 0 1 1 1 1 0 0 0 0 1 0 1 0 1 0 1 0 0 0 0 0 1
 0 0 0 1 1 0 0 0 0 0 0 0 0 1 0 0 1 0 0 0 0 0 1 1 1 1 0 0 0 0 0 0 0 0 0 0 0
 1 0 0 0 0 0 0 0 1 1 1 1 0 0 0 0 0 1 1 1 1 0 0 0 0 0 0 0 1 0 1 0 0 0 1 0 0
 1 0 0 0 0 0 0 0 0 0 1 0 1 0 0 0 1 1 0 0 0 1 0 1 0 0 0 0 1 1 0 1 0 0 0 1 0
 0 1 0 0 1 1 0 0 0 0 0 0 0 0 0 1 0 0 0 0 0 1 1 0 0 1 0 1 0 0 1 0 1 0 0 0 0
 0 1 1 1 1 1 0 1 0 0 0]

In [73]:
gabarito = gender_sub['Survived']

In [74]:
matriz_confusao = pd.DataFrame(data=confusion_matrix(gabarito, predict_test_titanic),columns=['Gabarito','predict_test_titanic'])
print('matriz de confusão\n', matriz_confusao)

print("\n",classification_report(gabarito,predict_test_titanic))

print('ROC SCORE: ', roc_auc_score(gabarito, predict_test_titanic)*100)

print('Acurácia da biblioteca DecisionTreeClassifier do SKLearn : ', np.mean(np.equal(predict_test_titanic, gabarito)))

matriz de confusão
    Gabarito  predict_test_titanic
0       251                    15
1        34                   118

               precision    recall  f1-score   support

           0       0.88      0.94      0.91       266
           1       0.89      0.78      0.83       152

    accuracy                           0.88       418
   macro avg       0.88      0.86      0.87       418
weighted avg       0.88      0.88      0.88       418

ROC SCORE:  85.99624060150376
Acurácia da biblioteca DecisionTreeClassifier do SKLearn :  0.8827751196172249

# Creating Dataframe to compar the prediction with kaggle results.

In [75]:
tabela_comparar = pd.DataFrame()
tabela_comparar['predict_test_titanic'] = predict_test_titanic
tabela_comparar['PassengerId_P']= test_titanic['PassengerId'].astype('int')
tabela_comparar['gabarito'] = gender_sub['Survived']
tabela_comparar['PassengerId_gabarito']=gender_sub['PassengerId']
tabela_comparar

     predict_test_titanic  PassengerId_P  gabarito  PassengerId_gabarito
0                       0            892         0                   892
1                       1            893         1                   893
2                       0            894         0                   894
3                       0            895         0                   895
4                       1            896         1                   896
..                    ...            ...       ...                   ...
413                     0           1305         0                  1305
414                     1           1306         1                  1306
415                     0           1307         0                  1307
416                     0           1308         0                  1308
417                     0           1309         0                  1309

[418 rows x 4 columns]

In [76]:
tabela_comparar['predict_test_titanic'].value_counts()

0    285
1    133
Name: predict_test_titanic, dtype: int64

In [77]:
tabela_comparar['gabarito'].value_counts()

0    266
1    152
Name: gabarito, dtype: int64

In [78]:
submission = pd.DataFrame(tabela_comparar,columns=['PassengerId_P','predict_test_titanic'])
submission

     PassengerId_P  predict_test_titanic
0              892                     0
1              893                     1
2              894                     0
3              895                     0
4              896                     1
..             ...                   ...
413           1305                     0
414           1306                     1
415           1307                     0
416           1308                     0
417           1309                     0

[418 rows x 2 columns]

In [79]:
submission = submission.rename(columns={'PassengerId_P': 'PassengerId', 'predict_test_titanic':'Survived'})

In [80]:
submission.to_csv("submission.csv",index=False)